%(7,4)分组码
clear all; close all;
H = [1 1 1 0 1 0 0;... 
     0 1 1 1 0 1 0;...
     1 1 0 1 0 0 1];

G = gen2par(H);  %调用Matlab函数求H的生成矩阵
Msg = [0 0 0 0;0 0 0 1;0 0 1 0;0 0 1 1;0 1 0 0;0 1 0 1;0 1 1 0;0 1 1 1;...
       1 0 0 0;1 0 0 1;1 0 1 0;1 0 1 1;1 1 0 0;1 1 0 1;1 1 1 0;1 1 1 1];
C = rem(Msg*G,2);

E = dec2bin([0:2^7-1],7)-48; %调用Matlab函数将整数转换成比特表示
S = rem(H*E',2);             %不同的E对应的校验子S

%对校验子归类，每个S对应不同的16个E
s = S(1,:)*4+S(2,:)*2+S(3,:);
for k=1:8
    e(k,:)=find(s==k-1);
end
e0 = dec2bin( e(1,:)-1,7 )-48; %对应S=000的E，编码码字
e1 = dec2bin( e(2,:)-1,7 )-48; %对应S＝001的E
e2 = dec2bin( e(3,:)-1,7 )-48; %对应S＝010的E
e3 = dec2bin( e(4,:)-1,7 )-48; %对应S＝011的E
e4 = dec2bin( e(5,:)-1,7 )-48; %对应S＝100的E
e5 = dec2bin( e(6,:)-1,7 )-48; %对应S＝101的E
e6 = dec2bin( e(7,:)-1,7 )-48; %对应S＝110的E
e7 = dec2bin( e(8,:)-1,7 )-48; %对应S＝111的E